## [PMM](https://opsx-poc.app.spacelift.io/stack/pmm/run/01H2TJEMKEN12C8Q51N5FNRFZV) plan logs

<details>
<summary>Click here to expand</summary>

```
[01H2RSVWRTFAWXSW40VDME60A0] Planning changes with 0 custom hooks...
aws_instance.web: Refreshing state... [id=i-05d24bb28a8db351c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.web must be replaced
-/+ resource "aws_instance" "web" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:309517936062:instance/i-05d24bb28a8db351c" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-05d24bb28a8db351c" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = "spacelift-ansible" # forces replacement
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0cb493c201fa29f37" -> (known after apply)
      ~ private_dns                          = "ip-172-30-0-55.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.30.0.55" -> (known after apply)
      ~ public_dns                           = "ec2-54-227-118-137.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.227.118.137" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Ansible" = "yes"
            "Name"    = "PMM Host"
            "Role"    = "PMM"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (8 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0105faa87a8c7d74a" -> null
          - volume_size           = 10 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

[01H2RSVWRTFAWXSW40VDME60A0] Changes are GO
[01H2RSVWRTFAWXSW40VDME60A0] Uploading the list of managed resources...
[01H2RSVWRTFAWXSW40VDME60A0] Please be aware that Run changes calculation includes Terraform output changes.
[01H2RSVWRTFAWXSW40VDME60A0] Resource list upload is GO
[01H2RSVWRTFAWXSW40VDME60A0] Generating JSON representation of the plan...
[01H2RSVWRTFAWXSW40VDME60A0] JSON representation is GO
[01H2RSVWRTFAWXSW40VDME60A0] Loading custom plan policy inputs...
[01H2RSVWRTFAWXSW40VDME60A0] 0 custom plan policy inputs found
[01H2RSVWRTFAWXSW40VDME60A0] No plan policies to evaluate
```

</details>